# CanEnableTemporaryViewPropertiesMode Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..CanEnableTemporaryViewPropertiesMode Method
View Class See Also
---
Indicates if Temporary View Properties mode can be applied for view in current state.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool CanEnableTemporaryViewPropertiesMode()
```

Visual Basic
---
```text
Public Function CanEnableTemporaryViewPropertiesMode As Boolean
```

Visual C++
---
```text
public:
bool CanEnableTemporaryViewPropertiesMode()
```

# ### Return Value
True if view can use Temporary View Properties mode in current state.
# See Also
View Class
Autodesk.Revit.DB Namespace